#include <stdio.h>


//数组-一组数，一组相同类型元素的集合
//数组的创建方式
//type_t arr_name [count_n]
//其中type_t是指数组元素的类型
//count_n是指一个常量表达式，用来指定数组的大小
//只有c99语法支持count_n用变量指定
//边长数组-数组的大小是变量
//linus系统下的gcc支持c99语法
//数组初始化-赋值
//int main()
//{
//	//int a = 10;//初始化
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//	//int arr[10] = { 1,2,3,4,5 };//不完全初始化
//	//char ch[5] = { 'b','i','t' };
//	//char ch2[] = { 'b','i','t' };
//	// [b, i, t]
//	//char ch3[5] = "bit";
//	//char ch4[] = "bir";
//	//[b,i,t,\0]
//	int arr[10] = { 0 };
//	arr[4] = 5;//[]--下标引用操作符
//	for (int i = 0; i < 10; i++)//打印数组每位的数
//	{
//		printf("&arr[%d] = %p\n",i, &arr[i]);
//	}
//	/*%p - 是按照地址的格式打印 - 十六进制的打印 - 会补齐空缺的位数*/
//	//1，一维数组在内存中是连续存放的；
//	//2，随着数组下标的增大，地址是由低到高变化的！
//	return 0;
//}


//int main()
//{
//	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr;//数组名是数组首元素的地址
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *p);
//		p++;
//	}
//	return 0;
//}


//二维数组
//创建
//int main()
//{
//	/*初始化 - 创建的同时给赋值*/
//	//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	//int arr2[3][4] = { 1,2,3,4,5,6 };
//	int arr3[3][4] = { {1,2},{3,4},{5,6} };
//	//不完全初始化 - 后面补0
//	/*行可以省略，列不可以省略*/
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%p ", &arr3[i][j]);//打印二维数组
//		}
//		printf("\n");
//	}
//	return 0;
//}


//二维数组在内存中的存储
//二维数组在内存中也是连续存放的！
//一行是连续的，跨行也是连续的

//int main()
//{
//	int i = 0;
//	int j = 0;
//	int arr[3][4] = { {1,2},{3,4},{5,6} };
//	int*p = &arr[0][0];
//	for (i = 0; i < 12; i++)
//	{
//		printf("%d ", *p);
//		p++;
//	}
//	return 0;
//}

//冒泡排序的思想：
//两两相邻的元素进行比较，并且可能的话需要进行交换
//其实数组名是首元素地址，有两个例外：
//1.sizeof(数组名)，这里的数组名表示整个数组，计算出来的是整个数组大小。
//2. & 数组名，这里的数组名表示的是整个数组，取出的是数组的地址。（如果加一则直接跳过整个数组的长度）


//冒泡排序--升序
//void bubble_sort(int arr[], int sz)
//{
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < sz - 1; i++)
//	{
//		for (j = 0; j < sz - 1 - i; j++)
//		{
//			int flag = 1;//优化算法利用flag检测交换循环内是否进行交换
//			if (arr[j] > arr[j + 1])
//			{
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//				flag = 0;
//			}
//			if (flag = 1)//没有进行交换则跳出循环
//			{
//				break;
//			}
// 
//		}
//
//	}
//
//}
//int main()
//{
//	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	printf("排序前：");
//	for (int i = 0; i < 10; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	bubble_sort(arr,sz);
//	printf("\n排序后：");
//	for (int i = 0; i < 10; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}
//
//int main()
//{
//	int arr[10] = { 0 };
//	int ret = &arr;
//	printf("%p %p\n", &arr + 1, arr + 1);//&arr其中的arr表示的是整个数组-取整个数组的地址，arr则表示这个数组的首元素地址
//	printf("%p %p\n", &arr,arr);
//	return 0;
//}

